{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "colab_type": "text",
    "id": "OwiY8RhOl8Bo"
   },
   "source": [
    "# Job counting for years"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "colab": {},
    "colab_type": "code",
    "id": "79_mr6zzl8Bp"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting py2neo\n",
      "  Downloading py2neo-2021.2.3-py2.py3-none-any.whl (177 kB)\n",
      "\u001b[K     |████████████████████████████████| 177 kB 2.5 MB/s eta 0:00:01\n",
      "\u001b[?25hRequirement already satisfied, skipping upgrade: pygments>=2.0.0 in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (2.7.2)\n",
      "Requirement already satisfied, skipping upgrade: six>=1.15.0 in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (1.15.0)\n",
      "Requirement already satisfied, skipping upgrade: packaging in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (20.4)\n",
      "Requirement already satisfied, skipping upgrade: certifi in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (2020.6.20)\n",
      "Requirement already satisfied, skipping upgrade: pansi>=2020.7.3 in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (2020.7.3)\n",
      "Requirement already satisfied, skipping upgrade: monotonic in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (1.6)\n",
      "Collecting interchange~=2021.0.4\n",
      "  Downloading interchange-2021.0.4-py2.py3-none-any.whl (28 kB)\n",
      "Requirement already satisfied, skipping upgrade: urllib3 in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (1.25.11)\n",
      "Requirement already satisfied, skipping upgrade: pyparsing>=2.0.2 in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from packaging->py2neo) (2.4.7)\n",
      "Requirement already satisfied, skipping upgrade: pytz in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from interchange~=2021.0.4->py2neo) (2020.1)\n",
      "Installing collected packages: interchange, py2neo\n",
      "  Attempting uninstall: interchange\n",
      "    Found existing installation: interchange 2021.0.3\n",
      "    Uninstalling interchange-2021.0.3:\n",
      "      Successfully uninstalled interchange-2021.0.3\n",
      "  Attempting uninstall: py2neo\n",
      "    Found existing installation: py2neo 2021.2.0\n",
      "    Uninstalling py2neo-2021.2.0:\n",
      "      Successfully uninstalled py2neo-2021.2.0\n",
      "Successfully installed interchange-2021.0.4 py2neo-2021.2.3\n"
     ]
    }
   ],
   "source": [
    "!pip install --upgrade py2neo\n",
    "from py2neo import Graph, Relationship, NodeMatcher\n",
    "from string import Template\n",
    "import pandas as pd \n",
    "\n",
    "#Login + PW for the local neo4j database\n",
    "graph = Graph(auth=(\"neo4j\", \"sonar2021\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "startYear = 50 \n",
    "steps = 50 #how big the time spans will end up in years"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Calculation for the voronois\n",
    "Birth dates are used for the temporal dimension. The inclusion of death dates would be better though but also slows down the query a lot. Sometimes years without results lead to errors. (A bug that's not solved yet)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## PerName"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 18 ms, sys: 5 ms, total: 23 ms\n",
      "Wall time: 14.1 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year_50</th>\n",
       "      <th>year_100</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Philosoph</th>\n",
       "      <td>3.0</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Historiker</th>\n",
       "      <td>2.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Arzt</th>\n",
       "      <td>2.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Rechtsanwalt</th>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Schriftsteller</th>\n",
       "      <td>2.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Geschichtsschreiber</th>\n",
       "      <td>2.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Offizier</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Chirurg</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Biograf</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Politiker</th>\n",
       "      <td>1.0</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Beamter</th>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Philologe</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Senator</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Adel</th>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>König</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Verwaltungsbeamter</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Schriftgelehrter</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Privatgelehrter</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Statthalter</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Erfinder</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Rabbiner</th>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Naturwissenschaftler</th>\n",
       "      <td>NaN</td>\n",
       "      <td>2.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Kaiser</th>\n",
       "      <td>NaN</td>\n",
       "      <td>2.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Kirchenhistoriker</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Märtyrerin</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Herrscher</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Pädagoge</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Künstler</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Priesterin</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Satiriker</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Grammatiker</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Geograf</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Psychologe</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Heilige</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Redner</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Kalligraph</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Astronom</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                      year_50  year_100\n",
       "Philosoph                 3.0       4.0\n",
       "Historiker                2.0       NaN\n",
       "Arzt                      2.0       NaN\n",
       "Rechtsanwalt              2.0       2.0\n",
       "Schriftsteller            2.0       5.0\n",
       "Geschichtsschreiber       2.0       NaN\n",
       "Offizier                  1.0       NaN\n",
       "Chirurg                   1.0       NaN\n",
       "Biograf                   1.0       NaN\n",
       "Politiker                 1.0       3.0\n",
       "Beamter                   1.0       1.0\n",
       "Philologe                 1.0       NaN\n",
       "Senator                   1.0       NaN\n",
       "Adel                      1.0       1.0\n",
       "König                    1.0       NaN\n",
       "Verwaltungsbeamter        1.0       NaN\n",
       "Schriftgelehrter          1.0       NaN\n",
       "Privatgelehrter           1.0       NaN\n",
       "Statthalter               1.0       NaN\n",
       "Erfinder                  1.0       NaN\n",
       "Rabbiner                  1.0       1.0\n",
       "Naturwissenschaftler      NaN       2.0\n",
       "Kaiser                    NaN       2.0\n",
       "Kirchenhistoriker         NaN       1.0\n",
       "Märtyrerin               NaN       1.0\n",
       "Herrscher                 NaN       1.0\n",
       "Pädagoge                 NaN       1.0\n",
       "Künstler                 NaN       1.0\n",
       "Priesterin                NaN       1.0\n",
       "Satiriker                 NaN       1.0\n",
       "Grammatiker               NaN       1.0\n",
       "Geograf                   NaN       1.0\n",
       "Psychologe                NaN       1.0\n",
       "Heilige                   NaN       1.0\n",
       "Redner                    NaN       1.0\n",
       "Kalligraph                NaN       1.0\n",
       "Astronom                  NaN       1.0"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "#topic term for PerNames (for all: 13min 11s). range defines the number of steps\n",
    "dfFinal = pd.DataFrame()\n",
    "for x in range(0, 2): \n",
    "    z = x*steps\n",
    "    startYear = 50\n",
    "    queryTemplate = Template('MATCH (n:PerName)-[rel:RelationToTopicTerm]-(t:TopicTerm) \\\n",
    "    WHERE (toInteger(n.DateApproxBegin) >= toInteger(${year})) AND (toInteger(n.DateApproxBegin) < toInteger(${year2})) \\\n",
    "    RETURN DISTINCT n.Id As ID, t.Name As year_${year}') \n",
    "    query = queryTemplate.substitute(year=startYear+z, year2=startYear+z+steps)\n",
    "    query\n",
    "    result = graph.run(query).data()\n",
    "\n",
    "    df = pd.DataFrame(result).drop_duplicates(subset=None, keep='first', inplace=False)\n",
    "    df3 = df[\"year_\"+str(startYear+z)].value_counts()\n",
    "    df4 = pd.DataFrame(df[\"year_\"+str(startYear+z)].value_counts())\n",
    "    dfFinal = pd.concat([dfFinal, df4], axis=1)\n",
    "\n",
    "dfFinal.fillna(0)\n",
    "dfFinal"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "dfFinal.index.name = 'EntityName'\n",
    "dfFinal.to_csv(\"persontopicterms_50er.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## GeoName"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 14.2 ms, sys: 9.39 ms, total: 23.6 ms\n",
      "Wall time: 21.2 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year_50</th>\n",
       "      <th>year_100</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Rom</th>\n",
       "      <td>3.0</td>\n",
       "      <td>2.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Trajanssäule</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Villa Laurentina</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Dakien</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Engelsburg</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Gallien</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Wu Liang ci</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Hildesheim</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Alexandria</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Villa di Plinio</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Hadriansvilla</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Selinunt</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>İzmit</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Hannover</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Terrazza Domizianea</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Tabula Traiana</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Antoninus-Pius-Säule</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Rätien</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Hadriansbogen</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Pantheon</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Epfach</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Como</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Italien</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Argo Navis</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Odeon des Herodes Atticus</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Constantine</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Mark-Aurel-Säule</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Marathon</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Jerusalem</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Villa des Herodes Atticus</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Acireale</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                           year_50  year_100\n",
       "Rom                            3.0       2.0\n",
       "Trajanssäule                  1.0       NaN\n",
       "Villa Laurentina               1.0       NaN\n",
       "Dakien                         1.0       NaN\n",
       "Engelsburg                     1.0       NaN\n",
       "Gallien                        1.0       NaN\n",
       "Wu Liang ci                    1.0       NaN\n",
       "Hildesheim                     1.0       NaN\n",
       "Alexandria                     1.0       NaN\n",
       "Villa di Plinio                1.0       NaN\n",
       "Hadriansvilla                  1.0       NaN\n",
       "Selinunt                       1.0       NaN\n",
       "İzmit                         1.0       NaN\n",
       "Hannover                       1.0       NaN\n",
       "Terrazza Domizianea            1.0       NaN\n",
       "Tabula Traiana                 1.0       NaN\n",
       "Antoninus-Pius-Säule          1.0       NaN\n",
       "Rätien                        1.0       NaN\n",
       "Hadriansbogen                  1.0       NaN\n",
       "Pantheon                       1.0       NaN\n",
       "Epfach                         1.0       NaN\n",
       "Como                           1.0       NaN\n",
       "Italien                        NaN       1.0\n",
       "Argo Navis                     NaN       1.0\n",
       "Odeon des Herodes Atticus      NaN       1.0\n",
       "Constantine                    NaN       1.0\n",
       "Mark-Aurel-Säule              NaN       1.0\n",
       "Marathon                       NaN       1.0\n",
       "Jerusalem                      NaN       1.0\n",
       "Villa des Herodes Atticus      NaN       1.0\n",
       "Acireale                       NaN       1.0"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "#Locations for PerName (for all: 14min 48s)\n",
    "dfFinalGeo = pd.DataFrame()\n",
    "for x in range(0, 2): \n",
    "    z = x*steps\n",
    "    startYear = 50\n",
    "    queryTemplate = Template('MATCH (n:PerName)--(t:GeoName) \\\n",
    "    WHERE (toInteger(n.DateApproxBegin) >= toInteger(${year})) AND (toInteger(n.DateApproxBegin) < toInteger(${year2})) \\\n",
    "    RETURN DISTINCT n.Id As ID, t.Name As year_${year}') \n",
    "    query = queryTemplate.substitute(year=startYear+z, year2=startYear+z+steps)\n",
    "    query\n",
    "    result = graph.run(query).data()\n",
    "\n",
    "    df = pd.DataFrame(result).drop_duplicates(subset=None, keep='first', inplace=False)\n",
    "    df3 = df[\"year_\"+str(startYear+z)].value_counts()\n",
    "    df4 = pd.DataFrame(df[\"year_\"+str(startYear+z)].value_counts())\n",
    "    dfFinalGeo = pd.concat([dfFinalGeo, df4], axis=1)\n",
    "\n",
    "dfFinalGeo.fillna(0)\n",
    "dfFinalGeo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "dfFinalGeo.index.name = 'EntityName'\n",
    "dfFinalGeo.to_csv(\"data-results/persongeonames_50er.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Ressources"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 135 ms, sys: 145 ms, total: 280 ms\n",
      "Wall time: 1h 49min 3s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year_1000</th>\n",
       "      <th>year_1050</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Neujahr</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Zeitschrift</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Bürgerbeteiligung</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Fest</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Bauplanung</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Hochschulschrift</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Verkehrsplanung</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Verkehrsanlage</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Bibliografie</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Monografische Reihe</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Konkordanz</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                     year_1000  year_1050\n",
       "Neujahr                    1.0        NaN\n",
       "Zeitschrift                1.0        NaN\n",
       "Bürgerbeteiligung         1.0        NaN\n",
       "Fest                       1.0        NaN\n",
       "Bauplanung                 1.0        NaN\n",
       "Hochschulschrift           1.0        NaN\n",
       "Verkehrsplanung            1.0        NaN\n",
       "Verkehrsanlage             1.0        NaN\n",
       "Bibliografie               1.0        NaN\n",
       "Monografische Reihe        1.0        NaN\n",
       "Konkordanz                 NaN        1.0"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "#for all, very slow: > 1h\n",
    "dfFinalResourceTopic = pd.DataFrame()\n",
    "for x in range(0, 1): \n",
    "    z = x*steps\n",
    "    startYear = 1000\n",
    "    queryTemplate = Template('MATCH (n:Resource)--(t:TopicTerm) \\\n",
    "    WHERE (toInteger(n.DateApproxBegin) >= toInteger(${year})) AND (toInteger(n.DateApproxBegin) < toInteger(${year2})) \\\n",
    "    RETURN DISTINCT n.Id As ID, t.Name As year_${year}') \n",
    "    query = queryTemplate.substitute(year=startYear+z, year2=startYear+z+steps)\n",
    "    query\n",
    "    result = graph.run(query).data()\n",
    "\n",
    "    df = pd.DataFrame(result).drop_duplicates(subset=None, keep='first', inplace=False)\n",
    "    df3 = df[\"year_\"+str(startYear+z)].value_counts()\n",
    "    df4 = pd.DataFrame(df[\"year_\"+str(startYear+z)].value_counts())\n",
    "    dfFinalResourceTopic = pd.concat([dfFinalResourceTopic, df4], axis=1)\n",
    "\n",
    "dfFinalResourceTopic.fillna(0)\n",
    "dfFinalResourceTopic"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "dfFinalResourceTopic.index.name = 'EntityName'\n",
    "dfFinalResourceTopic.to_csv(\"data-results/resourcetopic_50er.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## MeetName"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 1.31 s, sys: 40.9 ms, total: 1.35 s\n",
      "Wall time: 51.3 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year_1000</th>\n",
       "      <th>year_1050</th>\n",
       "      <th>year_1100</th>\n",
       "      <th>year_1150</th>\n",
       "      <th>year_1200</th>\n",
       "      <th>year_1250</th>\n",
       "      <th>year_1300</th>\n",
       "      <th>year_1350</th>\n",
       "      <th>year_1400</th>\n",
       "      <th>year_1450</th>\n",
       "      <th>...</th>\n",
       "      <th>year_1550</th>\n",
       "      <th>year_1600</th>\n",
       "      <th>year_1650</th>\n",
       "      <th>year_1700</th>\n",
       "      <th>year_1750</th>\n",
       "      <th>year_1800</th>\n",
       "      <th>year_1850</th>\n",
       "      <th>year_1900</th>\n",
       "      <th>year_1950</th>\n",
       "      <th>year_2000</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Synode</th>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>3.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>...</td>\n",
       "      <td>4.0</td>\n",
       "      <td>9.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>8.0</td>\n",
       "      <td>10.0</td>\n",
       "      <td>17.0</td>\n",
       "      <td>23.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Reichstag</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>4.0</td>\n",
       "      <td>11.0</td>\n",
       "      <td>...</td>\n",
       "      <td>7.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Konzil</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Hanse</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Versammlung</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Netzkunst</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Internet</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Atomphysik</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Jugendverband</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Park</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1142 rows × 21 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "               year_1000  year_1050  year_1100  year_1150  year_1200  \\\n",
       "Synode               1.0        1.0        1.0        1.0        1.0   \n",
       "Reichstag            NaN        1.0        NaN        1.0        NaN   \n",
       "Konzil               NaN        NaN        NaN        NaN        1.0   \n",
       "Hanse                NaN        NaN        NaN        NaN        NaN   \n",
       "Versammlung          NaN        NaN        NaN        NaN        NaN   \n",
       "...                  ...        ...        ...        ...        ...   \n",
       "Netzkunst            NaN        NaN        NaN        NaN        NaN   \n",
       "Internet             NaN        NaN        NaN        NaN        NaN   \n",
       "Atomphysik           NaN        NaN        NaN        NaN        NaN   \n",
       "Jugendverband        NaN        NaN        NaN        NaN        NaN   \n",
       "Park                 NaN        NaN        NaN        NaN        NaN   \n",
       "\n",
       "               year_1250  year_1300  year_1350  year_1400  year_1450  ...  \\\n",
       "Synode               1.0        1.0        NaN        3.0        1.0  ...   \n",
       "Reichstag            NaN        NaN        NaN        4.0       11.0  ...   \n",
       "Konzil               NaN        NaN        NaN        2.0        1.0  ...   \n",
       "Hanse                NaN        NaN        1.0        1.0        NaN  ...   \n",
       "Versammlung          NaN        NaN        1.0        1.0        NaN  ...   \n",
       "...                  ...        ...        ...        ...        ...  ...   \n",
       "Netzkunst            NaN        NaN        NaN        NaN        NaN  ...   \n",
       "Internet             NaN        NaN        NaN        NaN        NaN  ...   \n",
       "Atomphysik           NaN        NaN        NaN        NaN        NaN  ...   \n",
       "Jugendverband        NaN        NaN        NaN        NaN        NaN  ...   \n",
       "Park                 NaN        NaN        NaN        NaN        NaN  ...   \n",
       "\n",
       "               year_1550  year_1600  year_1650  year_1700  year_1750  \\\n",
       "Synode               4.0        9.0        1.0        1.0        1.0   \n",
       "Reichstag            7.0        3.0        1.0        NaN        NaN   \n",
       "Konzil               NaN        NaN        NaN        NaN        NaN   \n",
       "Hanse                NaN        1.0        NaN        NaN        NaN   \n",
       "Versammlung          1.0        1.0        NaN        NaN        NaN   \n",
       "...                  ...        ...        ...        ...        ...   \n",
       "Netzkunst            NaN        NaN        NaN        NaN        NaN   \n",
       "Internet             NaN        NaN        NaN        NaN        NaN   \n",
       "Atomphysik           NaN        NaN        NaN        NaN        NaN   \n",
       "Jugendverband        NaN        NaN        NaN        NaN        NaN   \n",
       "Park                 NaN        NaN        NaN        NaN        NaN   \n",
       "\n",
       "               year_1800  year_1850  year_1900  year_1950  year_2000  \n",
       "Synode               1.0        8.0       10.0       17.0       23.0  \n",
       "Reichstag            NaN        NaN        NaN        NaN        NaN  \n",
       "Konzil               NaN        1.0        NaN        1.0        NaN  \n",
       "Hanse                NaN        NaN        NaN        NaN        NaN  \n",
       "Versammlung          NaN        1.0        NaN        NaN        1.0  \n",
       "...                  ...        ...        ...        ...        ...  \n",
       "Netzkunst            NaN        NaN        NaN        NaN        1.0  \n",
       "Internet             NaN        NaN        NaN        NaN        1.0  \n",
       "Atomphysik           NaN        NaN        NaN        NaN        1.0  \n",
       "Jugendverband        NaN        NaN        NaN        NaN        1.0  \n",
       "Park                 NaN        NaN        NaN        NaN        1.0  \n",
       "\n",
       "[1142 rows x 21 columns]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "#for all, very fast\n",
    "dfFinalMeetTopic = pd.DataFrame()\n",
    "for x in range(0, 2): \n",
    "    z = x*steps\n",
    "    startYear = 1000\n",
    "    queryTemplate = Template('MATCH (n:MeetName)--(t:TopicTerm) \\\n",
    "    WHERE (toInteger(n.DateApproxBegin) >= toInteger(${year})) AND (toInteger(n.DateApproxBegin) < toInteger(${year2})) \\\n",
    "    RETURN DISTINCT n.Id As ID, t.Name As year_${year}') \n",
    "    query = queryTemplate.substitute(year=startYear+z, year2=startYear+z+steps)\n",
    "    query\n",
    "    result = graph.run(query).data()\n",
    "\n",
    "    df = pd.DataFrame(result).drop_duplicates(subset=None, keep='first', inplace=False)\n",
    "    df3 = df[\"year_\"+str(startYear+z)].value_counts()\n",
    "    df4 = pd.DataFrame(df[\"year_\"+str(startYear+z)].value_counts())\n",
    "    dfFinalMeetTopic  = pd.concat([dfFinalMeetTopic , df4], axis=1)\n",
    "\n",
    "dfFinalMeetTopic.fillna(0)\n",
    "dfFinalMeetTopic"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "dfFinalMeetTopic.index.name = 'EntityName'\n",
    "dfFinalMeetTopic.to_csv(\"data-results/meetnametopic_50er.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## UniTitle"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 146 ms, sys: 4.66 ms, total: 151 ms\n",
      "Wall time: 11.3 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year_1400</th>\n",
       "      <th>year_1450</th>\n",
       "      <th>year_1500</th>\n",
       "      <th>year_1550</th>\n",
       "      <th>year_1600</th>\n",
       "      <th>year_1650</th>\n",
       "      <th>year_1700</th>\n",
       "      <th>year_1750</th>\n",
       "      <th>year_1800</th>\n",
       "      <th>year_1850</th>\n",
       "      <th>year_1900</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Stadtrecht</th>\n",
       "      <td>3.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Friedensvertrag</th>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "      <td>2.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Feuerwerksbuch</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Frühneuhochdeutsch</th>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Halsgerichtsordnung</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Verfassung</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Experimentalfilm</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Funktechnik</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Jugendzeitung</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Ermächtigungsgesetz</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>154 rows × 11 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                      year_1400  year_1450  year_1500  year_1550  year_1600  \\\n",
       "Stadtrecht                  3.0        2.0        2.0        NaN        1.0   \n",
       "Friedensvertrag             1.0        1.0        NaN        NaN        NaN   \n",
       "Feuerwerksbuch              1.0        NaN        NaN        NaN        NaN   \n",
       "Frühneuhochdeutsch         1.0        NaN        NaN        NaN        NaN   \n",
       "Halsgerichtsordnung         NaN        1.0        NaN        NaN        NaN   \n",
       "...                         ...        ...        ...        ...        ...   \n",
       "Verfassung                  NaN        NaN        NaN        NaN        NaN   \n",
       "Experimentalfilm            NaN        NaN        NaN        NaN        NaN   \n",
       "Funktechnik                 NaN        NaN        NaN        NaN        NaN   \n",
       "Jugendzeitung               NaN        NaN        NaN        NaN        NaN   \n",
       "Ermächtigungsgesetz        NaN        NaN        NaN        NaN        NaN   \n",
       "\n",
       "                      year_1650  year_1700  year_1750  year_1800  year_1850  \\\n",
       "Stadtrecht                  NaN        NaN        NaN        NaN        NaN   \n",
       "Friedensvertrag             NaN        2.0        2.0        NaN        1.0   \n",
       "Feuerwerksbuch              NaN        NaN        NaN        NaN        NaN   \n",
       "Frühneuhochdeutsch         NaN        NaN        NaN        NaN        NaN   \n",
       "Halsgerichtsordnung         NaN        NaN        NaN        NaN        NaN   \n",
       "...                         ...        ...        ...        ...        ...   \n",
       "Verfassung                  NaN        NaN        NaN        NaN        NaN   \n",
       "Experimentalfilm            NaN        NaN        NaN        NaN        NaN   \n",
       "Funktechnik                 NaN        NaN        NaN        NaN        NaN   \n",
       "Jugendzeitung               NaN        NaN        NaN        NaN        NaN   \n",
       "Ermächtigungsgesetz        NaN        NaN        NaN        NaN        NaN   \n",
       "\n",
       "                      year_1900  \n",
       "Stadtrecht                  NaN  \n",
       "Friedensvertrag             2.0  \n",
       "Feuerwerksbuch              NaN  \n",
       "Frühneuhochdeutsch         NaN  \n",
       "Halsgerichtsordnung         NaN  \n",
       "...                         ...  \n",
       "Verfassung                  1.0  \n",
       "Experimentalfilm            1.0  \n",
       "Funktechnik                 1.0  \n",
       "Jugendzeitung               1.0  \n",
       "Ermächtigungsgesetz        1.0  \n",
       "\n",
       "[154 rows x 11 columns]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "#very fast\n",
    "dfFinalUniTitleTopic = pd.DataFrame()\n",
    "for x in range(0, 11): \n",
    "    z = x*steps\n",
    "    startYear = 1400\n",
    "    queryTemplate = Template('MATCH (n:UniTitle)--(t:TopicTerm) \\\n",
    "    WHERE (toInteger(n.DateApproxBegin) >= toInteger(${year})) AND (toInteger(n.DateApproxBegin) < toInteger(${year2})) \\\n",
    "    RETURN DISTINCT n.Id As ID, t.Name As year_${year}')\n",
    "    query = queryTemplate.substitute(year=startYear+z, year2=startYear+z+steps)\n",
    "    query\n",
    "    result = graph.run(query).data()\n",
    "\n",
    "    df = pd.DataFrame(result).drop_duplicates(subset=None, keep='first', inplace=False)\n",
    "    df3 = df[\"year_\"+str(startYear+z)].value_counts()\n",
    "    df4 = pd.DataFrame(df[\"year_\"+str(startYear+z)].value_counts())\n",
    "    dfFinalUniTitleTopic  = pd.concat([dfFinalUniTitleTopic , df4], axis=1)\n",
    "\n",
    "dfFinalUniTitleTopic.fillna(0)\n",
    "dfFinalUniTitleTopic"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "dfFinalUniTitleTopic.index.name = 'EntityName'\n",
    "dfFinalUniTitleTopic.to_csv(\"data-results/unititletopic_50er.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## CorpName\n",
    "The first variant is the variant we wanted to use, but couldn't get to work due to connection timeouts, so we had to use the second easier one relying just on the corp names instead of related topics to corp names."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 449 ms, sys: 40.7 ms, total: 489 ms\n",
      "Wall time: 12min 50s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year_50</th>\n",
       "      <th>year_100</th>\n",
       "      <th>year_150</th>\n",
       "      <th>year_200</th>\n",
       "      <th>year_250</th>\n",
       "      <th>year_300</th>\n",
       "      <th>year_350</th>\n",
       "      <th>year_400</th>\n",
       "      <th>year_450</th>\n",
       "      <th>year_500</th>\n",
       "      <th>...</th>\n",
       "      <th>year_800</th>\n",
       "      <th>year_850</th>\n",
       "      <th>year_900</th>\n",
       "      <th>year_950</th>\n",
       "      <th>year_1000</th>\n",
       "      <th>year_1050</th>\n",
       "      <th>year_1100</th>\n",
       "      <th>year_1150</th>\n",
       "      <th>year_1200</th>\n",
       "      <th>year_1250</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Druckerei</th>\n",
       "      <td>54.0</td>\n",
       "      <td>32.0</td>\n",
       "      <td>18.0</td>\n",
       "      <td>10.0</td>\n",
       "      <td>16.0</td>\n",
       "      <td>49.0</td>\n",
       "      <td>22.0</td>\n",
       "      <td>7.0</td>\n",
       "      <td>28.0</td>\n",
       "      <td>6.0</td>\n",
       "      <td>...</td>\n",
       "      <td>7.0</td>\n",
       "      <td>7.0</td>\n",
       "      <td>7.0</td>\n",
       "      <td>8.0</td>\n",
       "      <td>21.0</td>\n",
       "      <td>31.0</td>\n",
       "      <td>24.0</td>\n",
       "      <td>35.0</td>\n",
       "      <td>34.0</td>\n",
       "      <td>43.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Verlag</th>\n",
       "      <td>50.0</td>\n",
       "      <td>36.0</td>\n",
       "      <td>28.0</td>\n",
       "      <td>15.0</td>\n",
       "      <td>20.0</td>\n",
       "      <td>48.0</td>\n",
       "      <td>30.0</td>\n",
       "      <td>5.0</td>\n",
       "      <td>27.0</td>\n",
       "      <td>7.0</td>\n",
       "      <td>...</td>\n",
       "      <td>10.0</td>\n",
       "      <td>9.0</td>\n",
       "      <td>14.0</td>\n",
       "      <td>12.0</td>\n",
       "      <td>23.0</td>\n",
       "      <td>40.0</td>\n",
       "      <td>31.0</td>\n",
       "      <td>64.0</td>\n",
       "      <td>51.0</td>\n",
       "      <td>65.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Buchhandel</th>\n",
       "      <td>33.0</td>\n",
       "      <td>15.0</td>\n",
       "      <td>10.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>6.0</td>\n",
       "      <td>18.0</td>\n",
       "      <td>9.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>8.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>...</td>\n",
       "      <td>3.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>11.0</td>\n",
       "      <td>11.0</td>\n",
       "      <td>13.0</td>\n",
       "      <td>15.0</td>\n",
       "      <td>14.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Firma</th>\n",
       "      <td>9.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>...</td>\n",
       "      <td>1.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Sortimentsbuchhandel</th>\n",
       "      <td>7.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>6.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>3.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2.0</td>\n",
       "      <td>6.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>5.0</td>\n",
       "      <td>9.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Frömmigkeit</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Griffo</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Bibliothèque Nationale</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Lazurskij-Kyrillisch</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Oberster Gerichtshof</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>442 rows × 25 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                         year_50  year_100  year_150  year_200  year_250  \\\n",
       "Druckerei                   54.0      32.0      18.0      10.0      16.0   \n",
       "Verlag                      50.0      36.0      28.0      15.0      20.0   \n",
       "Buchhandel                  33.0      15.0      10.0       2.0       6.0   \n",
       "Firma                        9.0       3.0       2.0       1.0       1.0   \n",
       "Sortimentsbuchhandel         7.0       1.0       4.0       1.0       1.0   \n",
       "...                          ...       ...       ...       ...       ...   \n",
       "Frömmigkeit                 NaN       NaN       NaN       NaN       NaN   \n",
       "Griffo                       NaN       NaN       NaN       NaN       NaN   \n",
       "Bibliothèque Nationale      NaN       NaN       NaN       NaN       NaN   \n",
       "Lazurskij-Kyrillisch         NaN       NaN       NaN       NaN       NaN   \n",
       "Oberster Gerichtshof         NaN       NaN       NaN       NaN       NaN   \n",
       "\n",
       "                         year_300  year_350  year_400  year_450  year_500  \\\n",
       "Druckerei                    49.0      22.0       7.0      28.0       6.0   \n",
       "Verlag                       48.0      30.0       5.0      27.0       7.0   \n",
       "Buchhandel                   18.0       9.0       2.0       8.0       2.0   \n",
       "Firma                         3.0       3.0       NaN       2.0       1.0   \n",
       "Sortimentsbuchhandel          6.0       3.0       2.0       3.0       NaN   \n",
       "...                           ...       ...       ...       ...       ...   \n",
       "Frömmigkeit                  NaN       NaN       NaN       NaN       NaN   \n",
       "Griffo                        NaN       NaN       NaN       NaN       NaN   \n",
       "Bibliothèque Nationale       NaN       NaN       NaN       NaN       NaN   \n",
       "Lazurskij-Kyrillisch          NaN       NaN       NaN       NaN       NaN   \n",
       "Oberster Gerichtshof          NaN       NaN       NaN       NaN       NaN   \n",
       "\n",
       "                         ...  year_800  year_850  year_900  year_950  \\\n",
       "Druckerei                ...       7.0       7.0       7.0       8.0   \n",
       "Verlag                   ...      10.0       9.0      14.0      12.0   \n",
       "Buchhandel               ...       3.0       2.0       3.0       2.0   \n",
       "Firma                    ...       1.0       3.0       2.0       NaN   \n",
       "Sortimentsbuchhandel     ...       3.0       2.0       NaN       NaN   \n",
       "...                      ...       ...       ...       ...       ...   \n",
       "Frömmigkeit             ...       NaN       NaN       NaN       NaN   \n",
       "Griffo                   ...       NaN       NaN       NaN       NaN   \n",
       "Bibliothèque Nationale  ...       NaN       NaN       NaN       NaN   \n",
       "Lazurskij-Kyrillisch     ...       NaN       NaN       NaN       NaN   \n",
       "Oberster Gerichtshof     ...       NaN       NaN       NaN       NaN   \n",
       "\n",
       "                         year_1000  year_1050  year_1100  year_1150  \\\n",
       "Druckerei                     21.0       31.0       24.0       35.0   \n",
       "Verlag                        23.0       40.0       31.0       64.0   \n",
       "Buchhandel                     4.0       11.0       11.0       13.0   \n",
       "Firma                          2.0        4.0        2.0        3.0   \n",
       "Sortimentsbuchhandel           2.0        6.0        4.0        5.0   \n",
       "...                            ...        ...        ...        ...   \n",
       "Frömmigkeit                   NaN        NaN        NaN        NaN   \n",
       "Griffo                         NaN        NaN        NaN        NaN   \n",
       "Bibliothèque Nationale        NaN        NaN        NaN        NaN   \n",
       "Lazurskij-Kyrillisch           NaN        NaN        NaN        NaN   \n",
       "Oberster Gerichtshof           NaN        NaN        NaN        NaN   \n",
       "\n",
       "                         year_1200  year_1250  \n",
       "Druckerei                     34.0       43.0  \n",
       "Verlag                        51.0       65.0  \n",
       "Buchhandel                    15.0       14.0  \n",
       "Firma                          3.0        5.0  \n",
       "Sortimentsbuchhandel           9.0        5.0  \n",
       "...                            ...        ...  \n",
       "Frömmigkeit                   NaN        1.0  \n",
       "Griffo                         NaN        1.0  \n",
       "Bibliothèque Nationale        NaN        1.0  \n",
       "Lazurskij-Kyrillisch           NaN        1.0  \n",
       "Oberster Gerichtshof           NaN        1.0  \n",
       "\n",
       "[442 rows x 25 columns]"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "#Topic Terms for CorpName based on time for connected persons: very very slow. this \n",
    "dfFinalCorpTopic = pd.DataFrame()\n",
    "for x in range(0, 2): \n",
    "    z = x*steps\n",
    "    startYear = 50\n",
    "    queryTemplate = Template('MATCH (n:PerName)--(c:CorpName)--(t:TopicTerm) \\\n",
    "    WHERE (toInteger(n.DateApproxBegin) >= toInteger(${year})) AND (toInteger(n.DateApproxBegin) < toInteger(${year2})) \\\n",
    "    RETURN DISTINCT c.Id As ID, t.Name As year_${year}')\n",
    "    query = queryTemplate.substitute(year=startYear+z, year2=startYear+z+steps)\n",
    "    query\n",
    "    result = graph.run(query).data()\n",
    "\n",
    "    df = pd.DataFrame(result).drop_duplicates(subset=None, keep='first', inplace=False)\n",
    "    df3 = df[\"year_\"+str(startYear+z)].value_counts()\n",
    "    df4 = pd.DataFrame(df[\"year_\"+str(startYear+z)].value_counts())\n",
    "    dfFinalCorpTopic  = pd.concat([dfFinalCorpTopic , df4], axis=1)\n",
    "\n",
    "dfFinalCorpTopic.fillna(0)\n",
    "dfFinalCorpTopic"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## CorpName version used in visualization"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%time\n",
    "#still slow: 17min\n",
    "dfFinalCorpTopic9 = pd.DataFrame()\n",
    "for x in range(0, 2): #40\n",
    "    z = x*steps\n",
    "    startYear = 50\n",
    "    queryTemplate = Template('MATCH (n:PerName)--(c:CorpName) \\\n",
    "    WHERE (toInteger(n.DateApproxBegin) >= toInteger(${year})) AND (toInteger(n.DateApproxBegin) < toInteger(${year2})) \\\n",
    "    RETURN DISTINCT c.Id As ID, c.Name As year_${year}')\n",
    "    query = queryTemplate.substitute(year=startYear+z, year2=startYear+z+steps)\n",
    "    query\n",
    "    result = graph.run(query).data()\n",
    "\n",
    "    df = pd.DataFrame(result).drop_duplicates(subset=None, keep='first', inplace=False)\n",
    "    df3 = df[\"year_\"+str(startYear+z)].value_counts()\n",
    "    df4 = pd.DataFrame(df[\"year_\"+str(startYear+z)].value_counts())\n",
    "    dfFinalCorpTopic9 = pd.concat([dfFinalCorpTopic9, df4], axis=1)\n",
    "\n",
    "dfFinalCorpTopic2.fillna(0)\n",
    "dfFinalCorpTopic2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [],
   "source": [
    "dfFinalCorpTopic2.index.name = 'EntityName'\n",
    "dfFinalCorpTopic2.to_csv(\"data-results/corptopic_50er.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Expemplary counting of number of relations between CorpName to PerName by relation source (here GND)\n",
    "To get numbers for the other sources (DNB, SBB, KPE) rel.Source needs to be replaced.\n",
    "the range defines the time spane we look at."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 218 ms, sys: 21.1 ms, total: 239 ms\n",
      "Wall time: 10min 59s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year_50</th>\n",
       "      <th>year_100</th>\n",
       "      <th>year_150</th>\n",
       "      <th>year_200</th>\n",
       "      <th>year_250</th>\n",
       "      <th>year_300</th>\n",
       "      <th>year_350</th>\n",
       "      <th>year_400</th>\n",
       "      <th>year_450</th>\n",
       "      <th>year_500</th>\n",
       "      <th>...</th>\n",
       "      <th>year_1050</th>\n",
       "      <th>year_1100</th>\n",
       "      <th>year_1150</th>\n",
       "      <th>year_1200</th>\n",
       "      <th>year_1250</th>\n",
       "      <th>year_1300</th>\n",
       "      <th>year_1350</th>\n",
       "      <th>year_1400</th>\n",
       "      <th>year_1450</th>\n",
       "      <th>year_1500</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>7</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>...</td>\n",
       "      <td>29</td>\n",
       "      <td>32</td>\n",
       "      <td>33</td>\n",
       "      <td>41</td>\n",
       "      <td>41</td>\n",
       "      <td>37</td>\n",
       "      <td>69</td>\n",
       "      <td>131</td>\n",
       "      <td>300</td>\n",
       "      <td>678</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1 rows × 30 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   year_50  year_100  year_150  year_200  year_250  year_300  year_350  \\\n",
       "0        2         0         7         0         2         1         4   \n",
       "\n",
       "   year_400  year_450  year_500  ...  year_1050  year_1100  year_1150  \\\n",
       "0         0         0         1  ...         29         32         33   \n",
       "\n",
       "   year_1200  year_1250  year_1300  year_1350  year_1400  year_1450  year_1500  \n",
       "0         41         41         37         69        131        300        678  \n",
       "\n",
       "[1 rows x 30 columns]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "#PerName -- CorpName by year of perName: GND. Very slow! (hours)\n",
    "dfFinalCorpPerRel = pd.DataFrame()\n",
    "for x in range(20, 23): #40\n",
    "    z = x*steps\n",
    "    startYear = 50\n",
    "    queryTemplate = Template('MATCH (n:PerName)-[rel]-(c:CorpName) \\\n",
    "    WHERE (rel.Source = \"GND\") AND (toInteger(n.DateApproxBegin) >= toInteger(${year})) AND (toInteger(n.DateApproxBegin) < toInteger(${year2})) \\\n",
    "    RETURN count(rel) As year_${year}') \n",
    "    query = queryTemplate.substitute(year=startYear+z, year2=startYear+z+steps)\n",
    "    query\n",
    "    result = graph.run(query).data()\n",
    "\n",
    "    df = pd.DataFrame(result)\n",
    "    dfFinalCorpPerRel = pd.concat([dfFinalCorpPerRel, df], axis=1)\n",
    "\n",
    "dfFinalCorpPerRel"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "dfFinalCorpPerRel.to_csv(\"data-results/corp-rel-gnd_50er.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Example PerName to PerName Relations GND"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 209 ms, sys: 20 ms, total: 229 ms\n",
      "Wall time: 9min 47s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year_50</th>\n",
       "      <th>year_100</th>\n",
       "      <th>year_150</th>\n",
       "      <th>year_200</th>\n",
       "      <th>year_250</th>\n",
       "      <th>year_300</th>\n",
       "      <th>year_350</th>\n",
       "      <th>year_400</th>\n",
       "      <th>year_450</th>\n",
       "      <th>year_500</th>\n",
       "      <th>...</th>\n",
       "      <th>year_1050</th>\n",
       "      <th>year_1100</th>\n",
       "      <th>year_1150</th>\n",
       "      <th>year_1200</th>\n",
       "      <th>year_1250</th>\n",
       "      <th>year_1300</th>\n",
       "      <th>year_1350</th>\n",
       "      <th>year_1400</th>\n",
       "      <th>year_1450</th>\n",
       "      <th>year_1500</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>88</td>\n",
       "      <td>207</td>\n",
       "      <td>79</td>\n",
       "      <td>76</td>\n",
       "      <td>66</td>\n",
       "      <td>300</td>\n",
       "      <td>190</td>\n",
       "      <td>68</td>\n",
       "      <td>95</td>\n",
       "      <td>59</td>\n",
       "      <td>...</td>\n",
       "      <td>390</td>\n",
       "      <td>611</td>\n",
       "      <td>665</td>\n",
       "      <td>603</td>\n",
       "      <td>788</td>\n",
       "      <td>857</td>\n",
       "      <td>1294</td>\n",
       "      <td>2911</td>\n",
       "      <td>14524</td>\n",
       "      <td>31592</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1 rows × 30 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   year_50  year_100  year_150  year_200  year_250  year_300  year_350  \\\n",
       "0       88       207        79        76        66       300       190   \n",
       "\n",
       "   year_400  year_450  year_500  ...  year_1050  year_1100  year_1150  \\\n",
       "0        68        95        59  ...        390        611        665   \n",
       "\n",
       "   year_1200  year_1250  year_1300  year_1350  year_1400  year_1450  year_1500  \n",
       "0        603        788        857       1294       2911      14524      31592  \n",
       "\n",
       "[1 rows x 30 columns]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "#PerName -- PerName by year of perName1: GND\n",
    "dfFinalPerPerRel1 = pd.DataFrame()\n",
    "for x in range(0, 10): #40\n",
    "    z = x*steps\n",
    "    startYear = 50\n",
    "    queryTemplate = Template('MATCH (n:PerName)-[rel]-(c:PerName) \\\n",
    "    WHERE (rel.Source = \"GND\") AND (toInteger(n.DateApproxBegin) >= toInteger(${year})) AND (toInteger(n.DateApproxBegin) < toInteger(${year2})) \\\n",
    "    RETURN count(rel) As year_${year}') #n.EntityName As PerName, n.EntityId As PerNameID, \n",
    "    query = queryTemplate.substitute(year=startYear+z, year2=startYear+z+steps)\n",
    "    query\n",
    "    result = graph.run(query).data()\n",
    "\n",
    "    df = pd.DataFrame(result)\n",
    "    dfFinalPerPerRel1 = pd.concat([dfFinalPerPerRel1, df], axis=1)\n",
    "\n",
    "dfFinalPerPerRel1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "dfFinalPerPerRel1.to_csv(\"data-results/per-rel-gnd_50er.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Example GeoName to PerName Relations GND"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 258 ms, sys: 26.8 ms, total: 285 ms\n",
      "Wall time: 14min 9s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year_50</th>\n",
       "      <th>year_100</th>\n",
       "      <th>year_150</th>\n",
       "      <th>year_200</th>\n",
       "      <th>year_250</th>\n",
       "      <th>year_300</th>\n",
       "      <th>year_350</th>\n",
       "      <th>year_400</th>\n",
       "      <th>year_450</th>\n",
       "      <th>year_500</th>\n",
       "      <th>...</th>\n",
       "      <th>year_1300</th>\n",
       "      <th>year_1350</th>\n",
       "      <th>year_1400</th>\n",
       "      <th>year_1450</th>\n",
       "      <th>year_1500</th>\n",
       "      <th>year_1550</th>\n",
       "      <th>year_1600</th>\n",
       "      <th>year_1650</th>\n",
       "      <th>year_1700</th>\n",
       "      <th>year_1750</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>27</td>\n",
       "      <td>12</td>\n",
       "      <td>45</td>\n",
       "      <td>18</td>\n",
       "      <td>15</td>\n",
       "      <td>25</td>\n",
       "      <td>12</td>\n",
       "      <td>13</td>\n",
       "      <td>23</td>\n",
       "      <td>14</td>\n",
       "      <td>...</td>\n",
       "      <td>524</td>\n",
       "      <td>848</td>\n",
       "      <td>1726</td>\n",
       "      <td>4752</td>\n",
       "      <td>10697</td>\n",
       "      <td>22093</td>\n",
       "      <td>30623</td>\n",
       "      <td>40342</td>\n",
       "      <td>44923</td>\n",
       "      <td>58303</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1 rows × 35 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   year_50  year_100  year_150  year_200  year_250  year_300  year_350  \\\n",
       "0       27        12        45        18        15        25        12   \n",
       "\n",
       "   year_400  year_450  year_500  ...  year_1300  year_1350  year_1400  \\\n",
       "0        13        23        14  ...        524        848       1726   \n",
       "\n",
       "   year_1450  year_1500  year_1550  year_1600  year_1650  year_1700  year_1750  \n",
       "0       4752      10697      22093      30623      40342      44923      58303  \n",
       "\n",
       "[1 rows x 35 columns]"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "dfFinalGeoPerRel1 = pd.DataFrame()\n",
    "for x in range(0, 5): \n",
    "    z = x*steps\n",
    "    startYear = 50\n",
    "    queryTemplate = Template('MATCH (n:PerName)-[rel]-(c:GeoName) \\\n",
    "    WHERE (rel.Source = \"GND\") AND (toInteger(n.DateApproxBegin) >= toInteger(${year})) AND (toInteger(n.DateApproxBegin) < toInteger(${year2})) \\\n",
    "    RETURN count(rel) As year_${year}') #n.EntityName As PerName, n.EntityId As PerNameID, \n",
    "    query = queryTemplate.substitute(year=startYear+z, year2=startYear+z+steps)\n",
    "    query\n",
    "    result = graph.run(query).data()\n",
    "\n",
    "    df = pd.DataFrame(result)\n",
    "    dfFinalGeoPerRel1 = pd.concat([dfFinalGeoPerRel1, df], axis=1)\n",
    "\n",
    "dfFinalGeoPerRel1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [],
   "source": [
    "dfFinalGeoPerRel1.to_csv(\"data-results/geo-rel-gnd_50er.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Example Resource-PerName Relation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%time\n",
    "dfFinalResPerRel1 = pd.DataFrame()\n",
    "for x in range(0, 1): #40\n",
    "    z = x*steps\n",
    "    startYear = 50\n",
    "    queryTemplate = Template('MATCH (n:Resource)-[rel:RelationToPerName]-(p:PerName) \\\n",
    "    WHERE (toInteger(n.DateApproxBegin) >= toInteger(${year})) AND (toInteger(n.DateApproxBegin) < toInteger(${year2})) \\\n",
    "    AND (rel.Source = \"KPE\") \\\n",
    "    RETURN count(rel) As year_${year}')\n",
    "    query = queryTemplate.substitute(year=startYear+z, year2=startYear+z+steps)\n",
    "    query\n",
    "    result = graph.run(query).data()\n",
    "\n",
    "    df = pd.DataFrame(result)\n",
    "    dfFinalResPerRel1 = pd.concat([dfFinalResPerRel1, df], axis=1)\n",
    "\n",
    "dfFinalResPerRel1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Example for counting computed relations based on their source id"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.95 ms, sys: 9.15 ms, total: 12.1 ms\n",
      "Wall time: 13.1 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year_50</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   year_50\n",
       "0       16"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time \n",
    "##extremly slow\n",
    "dfFinalResPerRel2 = pd.DataFrame()\n",
    "for x in range(0, 1): #40\n",
    "    z = x*steps\n",
    "    startYear = 50\n",
    "    queryTemplate = Template('MATCH (n:PerName)-[rel:SocialRelation]-(p:PerName) \\\n",
    "    WHERE (toInteger(n.DateApproxBegin) >= toInteger(${year})) AND (toInteger(n.DateApproxBegin) < toInteger(${year2})) \\\n",
    "    AND ((rel.Source CONTAINS \"DE_611\") OR (rel.Source CONTAINS \"DE-611\"))\\\n",
    "    RETURN count(rel) As year_${year}')\n",
    "    query = queryTemplate.substitute(year=startYear+z, year2=startYear+z+steps)\n",
    "    query\n",
    "    result = graph.run(query).data()\n",
    "\n",
    "    df = pd.DataFrame(result)\n",
    "    dfFinalResPerRel2 = pd.concat([dfFinalResPerRel2, df], axis=1)\n",
    "\n",
    "dfFinalResPerRel2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "colab": {
   "collapsed_sections": [],
   "name": "neo4j-demo.ipynb",
   "provenance": []
  },
  "jupytext": {
   "cell_metadata_filter": "-all",
   "notebook_metadata_filter": "-all",
   "text_representation": {
    "extension": ".py",
    "format_name": "light"
   }
  },
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
