{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "colab_type": "text",
    "id": "OwiY8RhOl8Bo"
   },
   "source": [
    "# Node Timeline Statistics"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "colab": {},
    "colab_type": "code",
    "id": "79_mr6zzl8Bp"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting py2neo\n",
      "  Downloading py2neo-2021.1.5-py2.py3-none-any.whl (204 kB)\n",
      "\u001b[K     |████████████████████████████████| 204 kB 2.5 MB/s eta 0:00:01\n",
      "\u001b[?25hRequirement already satisfied, skipping upgrade: pansi>=2020.7.3 in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (2020.7.3)\n",
      "Requirement already satisfied, skipping upgrade: prompt-toolkit>=2.0.7; python_version >= \"3.6\" in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (3.0.8)\n",
      "Requirement already satisfied, skipping upgrade: neotime~=1.7.4 in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (1.7.4)\n",
      "Requirement already satisfied, skipping upgrade: monotonic in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (1.6)\n",
      "Requirement already satisfied, skipping upgrade: docker in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (5.0.0)\n",
      "Requirement already satisfied, skipping upgrade: certifi in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (2020.6.20)\n",
      "Requirement already satisfied, skipping upgrade: packaging in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (20.4)\n",
      "Requirement already satisfied, skipping upgrade: pygments>=2.0.0 in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (2.7.2)\n",
      "Requirement already satisfied, skipping upgrade: english in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (2020.7.0)\n",
      "Requirement already satisfied, skipping upgrade: pytz in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (2020.1)\n",
      "Requirement already satisfied, skipping upgrade: urllib3 in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (1.25.11)\n",
      "Requirement already satisfied, skipping upgrade: six>=1.15.0 in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (1.15.0)\n",
      "Requirement already satisfied, skipping upgrade: cryptography in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from py2neo) (3.1.1)\n",
      "Requirement already satisfied, skipping upgrade: wcwidth in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from prompt-toolkit>=2.0.7; python_version >= \"3.6\"->py2neo) (0.2.5)\n",
      "Requirement already satisfied, skipping upgrade: websocket-client>=0.32.0 in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from docker->py2neo) (0.59.0)\n",
      "Requirement already satisfied, skipping upgrade: requests!=2.18.0,>=2.14.2 in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from docker->py2neo) (2.24.0)\n",
      "Requirement already satisfied, skipping upgrade: pyparsing>=2.0.2 in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from packaging->py2neo) (2.4.7)\n",
      "Requirement already satisfied, skipping upgrade: cffi!=1.11.3,>=1.8 in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from cryptography->py2neo) (1.14.3)\n",
      "Requirement already satisfied, skipping upgrade: idna<3,>=2.5 in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from requests!=2.18.0,>=2.14.2->docker->py2neo) (2.10)\n",
      "Requirement already satisfied, skipping upgrade: chardet<4,>=3.0.2 in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from requests!=2.18.0,>=2.14.2->docker->py2neo) (3.0.4)\n",
      "Requirement already satisfied, skipping upgrade: pycparser in /Users/mark-janbludau/opt/anaconda3/lib/python3.8/site-packages (from cffi!=1.11.3,>=1.8->cryptography->py2neo) (2.20)\n",
      "Installing collected packages: py2neo\n",
      "  Attempting uninstall: py2neo\n",
      "    Found existing installation: py2neo 2021.1.1\n",
      "    Uninstalling py2neo-2021.1.1:\n",
      "      Successfully uninstalled py2neo-2021.1.1\n",
      "Successfully installed py2neo-2021.1.5\n"
     ]
    }
   ],
   "source": [
    "!pip install --upgrade py2neo\n",
    "from py2neo import Graph, Relationship, NodeMatcher\n",
    "from string import Template\n",
    "import pandas as pd \n",
    "\n",
    "#Login + PW for the local neo4j database\n",
    "graph = Graph(\"bolt+ssc://h2918680.stratoserver.net:7687\", auth=(\"sonar\", \"sonar2021\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [],
   "source": [
    "#options (startYear = first year (below 0 doesn't work yet), steps = next step in interval)\n",
    "startYear = 0\n",
    "steps = 50"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>9417</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(n)\n",
       "0      9417"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = 'MATCH (n:Resource) \\\n",
    "WHERE toInteger(n.DateApproxBegin) >= 1700 \\\n",
    "AND toInteger(n.DateApproxBegin) <= 1701 \\\n",
    "RETURN count(n)' \n",
    "#RETURN n.Name as Name, n.Title as Title, n.Id as Id, n.Genre as Genre, n.DateApproxBegin as DateApproxBegin, n.DateApproxEnd as DateApproxEnd, labels(n) as Label LIMIT 10' \n",
    "result = graph.run(query).data()\n",
    "dfTemp = pd.DataFrame(result)\n",
    "dfTemp"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Count numbers per year interval for each label"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 464 ms, sys: 62.1 ms, total: 526 ms\n",
      "Wall time: 22min 47s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year</th>\n",
       "      <th>PerName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>444</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>25</td>\n",
       "      <td>28</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>50</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>75</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>100</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1900</td>\n",
       "      <td>258748</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1925</td>\n",
       "      <td>535663</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1950</td>\n",
       "      <td>753336</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1975</td>\n",
       "      <td>349022</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2000</td>\n",
       "      <td>1034</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>81 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    year  PerName\n",
       "0      0      444\n",
       "0     25       28\n",
       "0     50       18\n",
       "0     75       12\n",
       "0    100       20\n",
       "..   ...      ...\n",
       "0   1900   258748\n",
       "0   1925   535663\n",
       "0   1950   753336\n",
       "0   1975   349022\n",
       "0   2000     1034\n",
       "\n",
       "[81 rows x 2 columns]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "#PerNames (schnell: 22min 47) aber Tod muss eingearbeteitet werden, damit Personen auch bei späteren Jahren auftauchen\n",
    "dfFinal2 = pd.DataFrame()\n",
    "for x in range(0, 40): #80\n",
    "    z = x*steps\n",
    "    queryTemplate = Template('\\\n",
    "    MATCH (n:PerName) \\\n",
    "    WHERE (toInteger(n.DateApproxBegin) >= toInteger(${year})) AND (toInteger(n.DateApproxBegin) < toInteger(${year2})) \\\n",
    "    RETURN ${year} As year, Count(DISTINCT n) As PerName')\n",
    "    query = queryTemplate.substitute(year=startYear+z, year2=startYear+z+steps)\n",
    "    result = graph.run(query).data()\n",
    "    df2 = pd.DataFrame(result)\n",
    "    dfFinal2 = dfFinal2.append(df2)\n",
    "\n",
    "dfFinal2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 347 ms, sys: 40.4 ms, total: 387 ms\n",
      "Wall time: 3min 36s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year</th>\n",
       "      <th>MeetName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>339</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>25</td>\n",
       "      <td>24</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>50</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>175</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>200</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1900</td>\n",
       "      <td>4273</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1925</td>\n",
       "      <td>7715</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1950</td>\n",
       "      <td>53383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1975</td>\n",
       "      <td>338208</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2000</td>\n",
       "      <td>259765</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>65 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    year  MeetName\n",
       "0      0       339\n",
       "0     25        24\n",
       "0     50         1\n",
       "0    175         3\n",
       "0    200         6\n",
       "..   ...       ...\n",
       "0   1900      4273\n",
       "0   1925      7715\n",
       "0   1950     53383\n",
       "0   1975    338208\n",
       "0   2000    259765\n",
       "\n",
       "[65 rows x 2 columns]"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "#MeetName (schnell: 3min 36s)\n",
    "dfFinal3 = pd.DataFrame()\n",
    "for x in range(0, 40): #80\n",
    "    z = x*steps\n",
    "    queryTemplate = Template('\\\n",
    "    MATCH (n:MeetName) \\\n",
    "    WHERE (toInteger(n.DateApproxBegin) >= toInteger(${year})) AND (toInteger(n.DateApproxBegin) < toInteger(${year2})) \\\n",
    "    RETURN ${year} As year, Count(DISTINCT n) As MeetName')\n",
    "    query = queryTemplate.substitute(year=startYear+z, year2=startYear+z+steps)\n",
    "    result = graph.run(query).data()\n",
    "    df3 = pd.DataFrame(result)\n",
    "    dfFinal3 = dfFinal3.append(df3)\n",
    "\n",
    "dfFinal3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 631 ms, sys: 308 ms, total: 939 ms\n",
      "Wall time: 3h 4min 43s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year</th>\n",
       "      <th>Resource</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>19928</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>50</td>\n",
       "      <td>15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>100</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>150</td>\n",
       "      <td>47</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>200</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>250</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>300</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>350</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>400</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>450</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>500</td>\n",
       "      <td>32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>550</td>\n",
       "      <td>33</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>600</td>\n",
       "      <td>99</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>650</td>\n",
       "      <td>249</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>700</td>\n",
       "      <td>52</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>750</td>\n",
       "      <td>38</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>800</td>\n",
       "      <td>253</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>850</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>900</td>\n",
       "      <td>89</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>950</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1000</td>\n",
       "      <td>95</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1050</td>\n",
       "      <td>27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1100</td>\n",
       "      <td>79</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1150</td>\n",
       "      <td>29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1200</td>\n",
       "      <td>79</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1250</td>\n",
       "      <td>241</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1300</td>\n",
       "      <td>1162</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1350</td>\n",
       "      <td>741</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1400</td>\n",
       "      <td>598</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1450</td>\n",
       "      <td>3094</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1500</td>\n",
       "      <td>41175</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1550</td>\n",
       "      <td>93215</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1600</td>\n",
       "      <td>107725</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1650</td>\n",
       "      <td>151450</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1700</td>\n",
       "      <td>172668</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1750</td>\n",
       "      <td>274207</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1800</td>\n",
       "      <td>513330</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1850</td>\n",
       "      <td>975718</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1900</td>\n",
       "      <td>3214440</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1950</td>\n",
       "      <td>9327726</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2000</td>\n",
       "      <td>7268540</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2050</td>\n",
       "      <td>48</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   year  Resource\n",
       "0     0     19928\n",
       "0    50        15\n",
       "0   100         5\n",
       "0   150        47\n",
       "0   200        13\n",
       "0   250         2\n",
       "0   300        13\n",
       "0   350         3\n",
       "0   400         8\n",
       "0   450        18\n",
       "0   500        32\n",
       "0   550        33\n",
       "0   600        99\n",
       "0   650       249\n",
       "0   700        52\n",
       "0   750        38\n",
       "0   800       253\n",
       "0   850        12\n",
       "0   900        89\n",
       "0   950         6\n",
       "0  1000        95\n",
       "0  1050        27\n",
       "0  1100        79\n",
       "0  1150        29\n",
       "0  1200        79\n",
       "0  1250       241\n",
       "0  1300      1162\n",
       "0  1350       741\n",
       "0  1400       598\n",
       "0  1450      3094\n",
       "0  1500     41175\n",
       "0  1550     93215\n",
       "0  1600    107725\n",
       "0  1650    151450\n",
       "0  1700    172668\n",
       "0  1750    274207\n",
       "0  1800    513330\n",
       "0  1850    975718\n",
       "0  1900   3214440\n",
       "0  1950   9327726\n",
       "0  2000   7268540\n",
       "0  2050        48"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "#Resourcen (sehr langsam: 3h 4min)\n",
    "dfFinal = pd.DataFrame()\n",
    "for x in range(0, 42): #80\n",
    "    z = x*steps\n",
    "    queryTemplate = Template('\\\n",
    "    MATCH (n:Resource) \\\n",
    "    WHERE (toInteger(n.DateApproxBegin) >= toInteger(${year})) AND (toInteger(n.DateApproxBegin) < toInteger(${year2})) \\\n",
    "    RETURN ${year} As year, Count(DISTINCT n) As Resource')\n",
    "    query = queryTemplate.substitute(year=startYear+z, year2=startYear+z+steps)\n",
    "    result = graph.run(query).data()\n",
    "    df = pd.DataFrame(result)\n",
    "    dfFinal = dfFinal.append(df)\n",
    "\n",
    "dfFinal"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 164 ms, sys: 20.1 ms, total: 184 ms\n",
      "Wall time: 50.2 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year</th>\n",
       "      <th>UniTitle</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>800</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1050</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1150</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1200</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1250</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1300</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1350</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1400</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1450</td>\n",
       "      <td>17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1500</td>\n",
       "      <td>70</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1550</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1600</td>\n",
       "      <td>113</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1650</td>\n",
       "      <td>113</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1700</td>\n",
       "      <td>202</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1750</td>\n",
       "      <td>419</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1800</td>\n",
       "      <td>375</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1850</td>\n",
       "      <td>352</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1900</td>\n",
       "      <td>1874</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1950</td>\n",
       "      <td>4858</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   year  UniTitle\n",
       "0   800         1\n",
       "0  1050         6\n",
       "0  1150         2\n",
       "0  1200        12\n",
       "0  1250        13\n",
       "0  1300        14\n",
       "0  1350         8\n",
       "0  1400        14\n",
       "0  1450        17\n",
       "0  1500        70\n",
       "0  1550       100\n",
       "0  1600       113\n",
       "0  1650       113\n",
       "0  1700       202\n",
       "0  1750       419\n",
       "0  1800       375\n",
       "0  1850       352\n",
       "0  1900      1874\n",
       "0  1950      4858"
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "#UniTitle (sehr schnell: 50.2 s)\n",
    "dfFinal4 = pd.DataFrame()\n",
    "for x in range(0, 40): #80\n",
    "    z = x*steps\n",
    "    queryTemplate = Template('\\\n",
    "    MATCH (n:UniTitle) \\\n",
    "    WHERE (toInteger(n.DateApproxBegin) >= toInteger(${year})) AND (toInteger(n.DateApproxBegin) < toInteger(${year2})) \\\n",
    "    RETURN ${year} As year, Count(DISTINCT n) As UniTitle')\n",
    "    query = queryTemplate.substitute(year=startYear+z, year2=startYear+z+steps)\n",
    "    result = graph.run(query).data()\n",
    "    df4 = pd.DataFrame(result)\n",
    "    dfFinal4 = dfFinal4.append(df4)\n",
    "\n",
    "dfFinal4"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>year</th>\n",
       "      <th>Resource</th>\n",
       "      <th>PerName</th>\n",
       "      <th>MeetName</th>\n",
       "      <th>UniTitle</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>19928</td>\n",
       "      <td>444.0</td>\n",
       "      <td>339.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>50</td>\n",
       "      <td>15</td>\n",
       "      <td>18.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>100</td>\n",
       "      <td>5</td>\n",
       "      <td>20.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>150</td>\n",
       "      <td>47</td>\n",
       "      <td>31.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>200</td>\n",
       "      <td>13</td>\n",
       "      <td>34.0</td>\n",
       "      <td>6.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>250</td>\n",
       "      <td>2</td>\n",
       "      <td>34.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>6</td>\n",
       "      <td>300</td>\n",
       "      <td>13</td>\n",
       "      <td>52.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>7</td>\n",
       "      <td>350</td>\n",
       "      <td>3</td>\n",
       "      <td>46.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>8</td>\n",
       "      <td>400</td>\n",
       "      <td>8</td>\n",
       "      <td>53.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>9</td>\n",
       "      <td>450</td>\n",
       "      <td>18</td>\n",
       "      <td>57.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>10</td>\n",
       "      <td>500</td>\n",
       "      <td>32</td>\n",
       "      <td>56.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>11</td>\n",
       "      <td>550</td>\n",
       "      <td>33</td>\n",
       "      <td>57.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>12</td>\n",
       "      <td>600</td>\n",
       "      <td>99</td>\n",
       "      <td>70.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>13</td>\n",
       "      <td>650</td>\n",
       "      <td>249</td>\n",
       "      <td>60.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>14</td>\n",
       "      <td>700</td>\n",
       "      <td>52</td>\n",
       "      <td>80.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>15</td>\n",
       "      <td>750</td>\n",
       "      <td>38</td>\n",
       "      <td>94.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>16</td>\n",
       "      <td>800</td>\n",
       "      <td>253</td>\n",
       "      <td>103.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>17</td>\n",
       "      <td>850</td>\n",
       "      <td>12</td>\n",
       "      <td>92.0</td>\n",
       "      <td>6.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>18</td>\n",
       "      <td>900</td>\n",
       "      <td>89</td>\n",
       "      <td>119.0</td>\n",
       "      <td>7.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>19</td>\n",
       "      <td>950</td>\n",
       "      <td>6</td>\n",
       "      <td>172.0</td>\n",
       "      <td>148.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>20</td>\n",
       "      <td>1000</td>\n",
       "      <td>95</td>\n",
       "      <td>229.0</td>\n",
       "      <td>7.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>21</td>\n",
       "      <td>1050</td>\n",
       "      <td>27</td>\n",
       "      <td>293.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>6.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>22</td>\n",
       "      <td>1100</td>\n",
       "      <td>79</td>\n",
       "      <td>298.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>23</td>\n",
       "      <td>1150</td>\n",
       "      <td>29</td>\n",
       "      <td>398.0</td>\n",
       "      <td>6.0</td>\n",
       "      <td>2.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>24</td>\n",
       "      <td>1200</td>\n",
       "      <td>79</td>\n",
       "      <td>411.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>12.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>25</td>\n",
       "      <td>1250</td>\n",
       "      <td>241</td>\n",
       "      <td>531.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>13.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>26</td>\n",
       "      <td>1300</td>\n",
       "      <td>1162</td>\n",
       "      <td>573.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>14.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>27</td>\n",
       "      <td>1350</td>\n",
       "      <td>741</td>\n",
       "      <td>742.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>8.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>28</td>\n",
       "      <td>1400</td>\n",
       "      <td>598</td>\n",
       "      <td>1249.0</td>\n",
       "      <td>8.0</td>\n",
       "      <td>14.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>29</td>\n",
       "      <td>1450</td>\n",
       "      <td>3094</td>\n",
       "      <td>2463.0</td>\n",
       "      <td>11.0</td>\n",
       "      <td>17.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>30</td>\n",
       "      <td>1500</td>\n",
       "      <td>41175</td>\n",
       "      <td>4840.0</td>\n",
       "      <td>17.0</td>\n",
       "      <td>70.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>31</td>\n",
       "      <td>1550</td>\n",
       "      <td>93215</td>\n",
       "      <td>10913.0</td>\n",
       "      <td>33.0</td>\n",
       "      <td>100.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>32</td>\n",
       "      <td>1600</td>\n",
       "      <td>107725</td>\n",
       "      <td>17871.0</td>\n",
       "      <td>22.0</td>\n",
       "      <td>113.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>33</td>\n",
       "      <td>1650</td>\n",
       "      <td>151450</td>\n",
       "      <td>18661.0</td>\n",
       "      <td>9.0</td>\n",
       "      <td>113.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>34</td>\n",
       "      <td>1700</td>\n",
       "      <td>172668</td>\n",
       "      <td>21594.0</td>\n",
       "      <td>9.0</td>\n",
       "      <td>202.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>35</td>\n",
       "      <td>1750</td>\n",
       "      <td>274207</td>\n",
       "      <td>34171.0</td>\n",
       "      <td>17.0</td>\n",
       "      <td>419.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>36</td>\n",
       "      <td>1800</td>\n",
       "      <td>513330</td>\n",
       "      <td>62458.0</td>\n",
       "      <td>56.0</td>\n",
       "      <td>375.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>37</td>\n",
       "      <td>1850</td>\n",
       "      <td>975718</td>\n",
       "      <td>113264.0</td>\n",
       "      <td>688.0</td>\n",
       "      <td>352.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>38</td>\n",
       "      <td>1900</td>\n",
       "      <td>3214440</td>\n",
       "      <td>258748.0</td>\n",
       "      <td>4273.0</td>\n",
       "      <td>1874.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>39</td>\n",
       "      <td>1950</td>\n",
       "      <td>9327726</td>\n",
       "      <td>753336.0</td>\n",
       "      <td>53383.0</td>\n",
       "      <td>4858.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>40</td>\n",
       "      <td>2000</td>\n",
       "      <td>7268540</td>\n",
       "      <td>1034.0</td>\n",
       "      <td>259765.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>41</td>\n",
       "      <td>2050</td>\n",
       "      <td>48</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    index  year  Resource   PerName  MeetName  UniTitle\n",
       "0       0     0     19928     444.0     339.0       0.0\n",
       "1       1    50        15      18.0       1.0       0.0\n",
       "2       2   100         5      20.0       0.0       0.0\n",
       "3       3   150        47      31.0       0.0       0.0\n",
       "4       4   200        13      34.0       6.0       0.0\n",
       "5       5   250         2      34.0       1.0       0.0\n",
       "6       6   300        13      52.0       1.0       0.0\n",
       "7       7   350         3      46.0       3.0       0.0\n",
       "8       8   400         8      53.0       1.0       0.0\n",
       "9       9   450        18      57.0       2.0       0.0\n",
       "10     10   500        32      56.0       0.0       0.0\n",
       "11     11   550        33      57.0       1.0       0.0\n",
       "12     12   600        99      70.0       0.0       0.0\n",
       "13     13   650       249      60.0       1.0       0.0\n",
       "14     14   700        52      80.0       0.0       0.0\n",
       "15     15   750        38      94.0       1.0       0.0\n",
       "16     16   800       253     103.0       0.0       1.0\n",
       "17     17   850        12      92.0       6.0       0.0\n",
       "18     18   900        89     119.0       7.0       0.0\n",
       "19     19   950         6     172.0     148.0       0.0\n",
       "20     20  1000        95     229.0       7.0       0.0\n",
       "21     21  1050        27     293.0       3.0       6.0\n",
       "22     22  1100        79     298.0       2.0       0.0\n",
       "23     23  1150        29     398.0       6.0       2.0\n",
       "24     24  1200        79     411.0       2.0      12.0\n",
       "25     25  1250       241     531.0       1.0      13.0\n",
       "26     26  1300      1162     573.0       2.0      14.0\n",
       "27     27  1350       741     742.0       2.0       8.0\n",
       "28     28  1400       598    1249.0       8.0      14.0\n",
       "29     29  1450      3094    2463.0      11.0      17.0\n",
       "30     30  1500     41175    4840.0      17.0      70.0\n",
       "31     31  1550     93215   10913.0      33.0     100.0\n",
       "32     32  1600    107725   17871.0      22.0     113.0\n",
       "33     33  1650    151450   18661.0       9.0     113.0\n",
       "34     34  1700    172668   21594.0       9.0     202.0\n",
       "35     35  1750    274207   34171.0      17.0     419.0\n",
       "36     36  1800    513330   62458.0      56.0     375.0\n",
       "37     37  1850    975718  113264.0     688.0     352.0\n",
       "38     38  1900   3214440  258748.0    4273.0    1874.0\n",
       "39     39  1950   9327726  753336.0   53383.0    4858.0\n",
       "40     40  2000   7268540    1034.0  259765.0       0.0\n",
       "41     41  2050        48       0.0       0.0       0.0"
      ]
     },
     "execution_count": 64,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#merge the data to one dataset\n",
    "dfFinalAll = pd.merge(dfFinal, dfFinal2, how='left')\n",
    "dfFinalAll = pd.merge(dfFinalAll, dfFinal3, how='left')\n",
    "dfFinalAll = pd.merge(dfFinalAll, dfFinal4, how='left')\n",
    "dfFinalAll.fillna(0).reset_index()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "metadata": {},
   "outputs": [],
   "source": [
    "#save as csv\n",
    "dfFinalAll.to_csv(\"data-results/timeline-data.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "colab": {
   "collapsed_sections": [],
   "name": "neo4j-demo.ipynb",
   "provenance": []
  },
  "jupytext": {
   "cell_metadata_filter": "-all",
   "notebook_metadata_filter": "-all",
   "text_representation": {
    "extension": ".py",
    "format_name": "light"
   }
  },
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
